RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_usart.c
    if (interrupt & 0x10000)
    {
        usart->CTRL1 |= temp;
    }

    if (interrupt & 0x20000)
    {
        usart->CTRL2 |= temp;
    }

    if (interrupt & 0x40000)
    {
        usart->CTRL3 |= temp;
    }
}

/*!
 * @brief     Disables the specified USART interrupts
 *
 * @param     usart: Select the USART or the UART peripheral
 *
 * @param     interrupt: Specifies the USART interrupts sources
 *                       The parameter can be one of following values:
 *                       @arg USART_INT_PE      : Parity error interrupt
 *                       @arg USART_INT_TXBE    : Tansmit data buffer empty interrupt
 *                       @arg USART_INT_TXC     : Transmission complete interrupt
 *                       @arg USART_INT_RXBNE   : Receive data buffer not empty interrupt
 *                       @arg USART_INT_IDLE    : Idle line detection interrupt
 *                       @arg USART_INT_LBD     : LIN break detection interrupt
 *                       @arg USART_INT_CTS     : CTS change interrupt
 *                       @arg USART_INT_ERR     : Error interrupt(Frame error, noise error, overrun error)
 *
 * @retval    None
 *
 * @note      The usart can be USART1, USART2, USART3, UART4, UART5, USART6, UART7 and UART8
 */
void USART_DisableInterrupt(USART_T* usart, USART_INT_T interrupt)
{
    uint32_t temp;

    temp = (uint32_t)~(interrupt & 0xffff);

    if (interrupt & 0x10000)
    {
        usart->CTRL1 &= temp;
    }

    if (interrupt & 0x20000)
    {
        usart->CTRL2 &= temp;
    }

    if (interrupt & 0x40000)
    {
        usart->CTRL3 &= temp;
    }
}

/*!
 * @brief     Read the specified USART flag
 *
 * @param     usart: Select the USART or the UART peripheral
 *
 * @param     flag: Specifies the flag to check
 *                  The parameter can be one of following values:
 *                  @arg USART_FLAG_CTS     : CTS Change flag (not available for UART4 and UART5)
 *                  @arg USART_FLAG_LBD     : LIN Break detection flag
 *                  @arg USART_FLAG_TXBE    : Transmit data buffer empty flag
 *                  @arg USART_FLAG_TXC     : Transmission Complete flag
 *                  @arg USART_FLAG_RXBNE   : Receive data buffer not empty flag
 *                  @arg USART_FLAG_IDLE    : Idle Line detection flag
 *                  @arg USART_FLAG_OVRE    : OverRun Error flag
 *                  @arg USART_FLAG_NE      : Noise Error flag
 *                  @arg USART_FLAG_FE      : Framing Error flag
 *                  @arg USART_FLAG_PE      : Parity Error flag
 *
 * @retval    The new state of flag (SET or RESET)
 *
 * @note      The usart can be USART1, USART2, USART3, UART4, UART5, USART6, UART7 and UART8
 */
uint8_t USART_ReadStatusFlag(USART_T* usart, USART_FLAG_T flag)
{
    return (usart->STS & flag) ? SET : RESET;
}

/*!
 * @brief     Clears the USARTx's pending flags
 *
 * @param     usart: Select the USART or the UART peripheral
 *
 * @param     flag: Specifies the flag to clear
 *                  The parameter can be one of following values:
 *                  @arg USART_FLAG_CTS     : CTS Change flag (not available for UART4 and UART5)
 *                  @arg USART_FLAG_LBD     : LIN Break detection flag
 *                  @arg USART_FLAG_TXC     : Transmission Complete flag
 *                  @arg USART_FLAG_RXBNE   : Receive data buffer not empty flag
 *
 * @retval    None
 *
 * @note      The usart can be USART1, USART2, USART3, UART4, UART5, USART6, UART7 and UART8
 */
void USART_ClearStatusFlag(USART_T* usart, USART_FLAG_T flag)
{
    usart->STS &= (uint32_t)~flag;
}

/*!
 * @brief     Read the specified USART interrupt flag
 *
 * @param     usart: Select the USART or the UART peripheral
 *
 * @param     flag:  Specifies the USART interrupt source to check
 *                        The parameter can be one of following values:
 *                        @arg USART_INT_TXBE    : Tansmit data buffer empty interrupt
 *                        @arg USART_INT_TXC     : Transmission complete interrupt
 *                        @arg USART_INT_RXBNE   : Receive data buffer not empty interrupt
 *                        @arg USART_INT_IDLE    : Idle line detection interrupt
 *                        @arg USART_INT_LBD     : LIN break detection interrupt
 *                        @arg USART_INT_CTS     : CTS change interrupt
 *                        @arg USART_INT_OVRE_RX : OverRun Error interruptpt if the RXBNFLG bit is set
 *                        @arg USART_INT_OVRE_ER : OverRun Error interruptpt if the EIE bit is set
 *                        @arg USART_INT_NE      : Noise Error interrupt
 *                        @arg USART_INT_FE      : Framing Error interrupt
 *                        @arg USART_INT_PE      : Parity error interrupt
 *
 * @retval    The new state of flag (SET or RESET)
 *
 * @note      The usart can be USART1, USART2, USART3, UART4, UART5, USART6, UART7 and UART8
 */
uint8_t USART_ReadIntFlag(USART_T* usart, USART_INT_T flag)
{
    uint32_t itFlag, srFlag;

    if (flag & 0x10000)
    {
        itFlag = usart->CTRL1 & flag & 0xffff;
    }
    else if (flag & 0x20000)
    {
        itFlag = usart->CTRL2 & flag & 0xffff;
    }
    else
    {
        itFlag = usart->CTRL3 & flag & 0xffff;
    }

    srFlag = flag >> 24;
    srFlag = (uint32_t)(1 << srFlag);
    srFlag = usart->STS & srFlag;

    if (srFlag && itFlag)
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief     Clears the USART interrupt pending bits
 *
 * @param     usart: Select the USART or the UART peripheral
 *
 * @param     flag: Specifies the interrupt pending bit to clear
 *                  The parameter can be one of following values:
 *                  @arg USART_INT_RXBNE : Receive data buffer not empty interrupt
 *                  @arg USART_INT_TXC   : Transmission complete interrupt
 *                  @arg USART_INT_LBD   : LIN break detection interrupt
 *                  @arg USART_INT_CTS   : CTS change interrupt
 *
 * @retval    None
 *
 * @note      The usart can be USART1, USART2, USART3, UART4, UART5, USART6, UART7 and UART8
 */
void USART_ClearIntFlag(USART_T* usart, USART_INT_T flag)
{
    uint32_t srFlag;

    srFlag = flag >> 24;
    srFlag = (uint32_t)(1 << srFlag);

    usart->STS &= (uint32_t)~srFlag;
}

/**@} end of group USART_Functions */
/**@} end of group USART_Driver */
/**@} end of group APM32F4xx_StdPeriphDriver */
